{"hash":"QmSFUeiDNFmMUgrm811buxSePzhMFEKkvj9L54ih7JNMsN","data":"Terms & Conditions (Version 14.08.19) \n\n1. Introduction \nThe following Terms & Conditions (the “Terms”) apply to the membership with\nCommons Stack Association (the “Association”). Commons Stack Association is\na Swiss association pursuant to Art. 60 ff. of the Swiss Civil Code. The purpose\nof the Association is to design, to simulate and to build reference iterations\nfor novel types of ecosystems that create continuous funding that can be\ncollectively governed to support a common good (the “Project”). The end\nproduct is the codebase for a functional prototype that can be deployed by\nanyone and altered to the future needs of users. The members of the Association\nuse the structure of the Association to coordinate the Project iteration\nincluding all stakeholders. The association does not pursue a commercial purpose\nand does not strive for profit. \n\n2. Build Phase \nDuring the Build Phase, the Association will oversee the creation of modular\nSmart Contract Systems (the “Iterations”) which altogether will compose the\nCommons Stack. The Association will utilize rigorous systems engineering\nprocesses to produce a series of iterations which can be used to deploy\npurpose-driven tokens for the governance of a continuously funded DAO. The\ndesign approach to these Smart Contract System modules is iterative, rigorous\nand scientific, ensuring robust and scalable systems for use in the real-world.\n\nThe association is collecting membership fees and donations to fund the\ndevelopment of the Commons Stack. Each member will receive CSTK Tokens which at\na later stage can be used by the Token Engineering Community to initiate a Smart\nContract System to boot-strap their own community out of the first iteration\nthat the Commons Stack Association produces. The CSTK Token neither embodies any\nvoting rights nor does it entitle the holder to the association's assets. Only\nmembers that have passed KYC and AML procedures (described in Section 8) will\nreceive CSTK Tokens. These Tokens are not transferable as their purpose is to be\nused by Smart Contract Systems as a trusted seed to initialize DAOs using the\nCommons Stack Codebase. The CSTK Token does not represent a membership right in\nthe Association. It is neither a prerequisite nor a condition that Members must\nhave CSTK tokens, nor are CSTK Token holders automatically members. In addition\nit is possible to donate to the Association, which does not entitle to receive\nany CSTK Tokens. \nIf the Association receives enough membership fees, they will build 5 iterations\nof the Commons Stack Codebase, drastically improving the codebase with every\niteration. Each codebase can be used to deploy a completely decentralized Smart\nContract System that is independent of the Commons Stack Association. \n\n3. Live Phase \nAfter the codebase iterations are developed, each iteration can be used to\ncreate decentralized autonomous organizations (“DAO”). The Live Phase begins\nwhen an iteration is deployed by a community and is able to receive their chosen\nreserve currency (e.g. DAI). This initial period after the deployment is defined\nas the “Hatch Phase”. During the Hatch Phase, if the Community uses the\ndefaults set forth in the iteration’s codebase, all CSTK Token Holders\n(Members) have the opportunity to send a reserve currency (e.g. DAI) to the DAO\nat a rate of one unit of reserve currency for every CSTK Token they hold in\ntheir address. This renewed payment is necessary in order to receive token of\nthe iteration. This Hatch Phase is designed by the Commons Stack Association but\nthe Commons Stack Association has no intention of launching any of the Live\nPhases themselves. \nMultiplier - The amount of CSTK Tokens each member received is determined by how\nmuch they paid in membership fees to the Commons Stack and when the payment\noccurs. The amount of reserve currency (likely to be Dai or equivalent\nstablecoin) that members are allowed to contribute to each deployed Iteration\n(if the DAO uses the CSTK Token) is defined by the amount of CSTK Tokens each\nmember has in his possession. \nAny member that pays membership fees to the Commons Stack Association before the\nAssociation receives the minimum funding goal for Iteration #1 will receive a\n2.5x multiplier. As in, if there is a contribution of 10,000 DAI, the member\nreceives 25,000 CSTK Tokens. Any membership fee after that but before we reach\nour funding goal for Iteration #2 will receive a 2x multiplier. As in, if there\nis a membership fee of 10,000 DAI, the member receives 20,000 CSTK Tokens. Any\nmembership fee after that but before we reach our goal for Iteration #3 will\nreceive a 1.5x multiplier. As in, if there is a membership fee of 10,000 DAI,\nthe member receives 15,000 CSTK Tokens. Any membership fee after that but before\nwe reach our goal for Iteration #4 will receive a 1.25x multiplier. As in, if\nthere is a membership fee of 10,000 DAI, the member receives 12,500 CSTK Tokens.\nAnd anyone who pays membership fees after that will receive CSTK Tokens at a 1\nfor 1 rate. As in, if there is a membership fee of 10,000 DAI, the member\nreceives 10,000 CSTK Tokens. \nAdvisers and Commons Stack Core Team Members that contribute before August 23,\n2019 will get a 3x multiplier. As in, if there is a membership fee of 10,000\nDAI, the member receives 30,000 CSTK Tokens. \nAdvisers and Commons Stack Core Team Members that contribute to the Commons\nStack Prelaunch Giveth Campaign, and have their funds used to full fill payments\nfor work done before the funding has met the minimum funding goal for iteration\n1 will get a 4x multiplier. As in, if there is a contribution of 10,000 DAI, the\ncontributor will be awarded 40,000 CSTK Tokens. \nEach Advisor to the Commons Stack Association will receive 10,000 CSTK Tokens\nfor their work reviewing and advising on the design and execution of the Commons\nStack Codebase and funding goal. \nMembers of the Association as well as the independent contractors that built the\nSmart Contract Systems will be given access to participate in this Hatch Phase.\nOthers are not allowed to participate in this stage. CSTK Tokens are not\ntransferable and it is a violation of these terms of service to transfer them by\nany means to other members or third parties. The Commons Stack Association has\nthe right to revoke membership and burn CSTK Tokens owned by any member if there\nis any violation of these terms of service. \n\n4. Duration of the Build Phase \nThe Build Phase shall end on or before September 2022. The Association reserves\nthe right to change the duration of the Build Phase for any reason, including\nthe unavailability of raising enough funds in order to develop the Smart\nContract Systems or any other unforeseen procedural or security issues. \n\n5. Membership rights 5.1 Voting rights \nEach individual member has one vote at the general assembly of the Association\n(the “Individual Member”). \n\n5.2 Possibility to send tokens into a Token Bonding Curve during a Live Phase \nAs stated in section 3, each CSTK Token holder has the possibility to send\ntokens to the Smart Contract System during the Hatch Phase as a maximum the same\namount as they own CSTK Token. In return, for this renewed payment only they\nshall receive ‘ABC’ Tokens. Members of the Association as well as the\nparties that built the Smart Contract Systems will be given access to this Hatch\nPhase. It is at the discretion of each DAO to use the Commons Stack Member\nTokens as a whitelist for the hatch phase. The members of the Association are\nnot entitled to receive Tokens without a renewed payment during the Live Phase.\n\n\n5.3 Further rights \nThe members of the Association shall have all rights, which the Art. 60 ff. of\nthe Swiss Civil Code provides. \n\n5.4 Publication on the Association’s website \nEach member has the right to be named as a Patron on the Association’s\nwebsite. Without your explicit consent, the Association will not publish your\nname on the website. \n\n6. Membership obligation \nEach member has to pay the membership fee and follow these terms and conditions.\nMembers may be excluded by a decision by the Board if they do not fulfill the\nfinancial obligations after two written reminders. Liability incurred by the\nAssociation is limited exclusively to the Association's funds. Any personal\nliability of its members is expressly excluded. \n\n7. Application & confirmation of membership \nApplications for membership must be addressed to the board of the Association.\nThe board decides on the admission of new members and informs the general\nassembly about it. The membership is acquired by acceptance of the application\nby the board and the payment of the membership fee. Furthermore, the acceptance\nof the application is subject to a successful KYC and AML process. A rejection\ndoes not have to be justified. \nAs soon as the board accepts your application and the membership is paid, you\nwill receive an email with a confirmation about the membership. \n\n8. Registration and KYC/AML Policy \nAs part of the application, in order to receive CSTK Tokens and also to\nparticipate later in Hatch Phases, any new member will need to provide full\nKYC/AML information and fulfill a registration process through the\nAssociation’s website. The Association will not publish any identifying\ninformation related to a member without the prior written consent of the member.\nMembers may be contacted by email by the Association regarding their membership.\n\nNew members have to investigate for themselves if they are eligible to\nparticipate in the Association. The Association may at any time refund\ncontributions from any jurisdiction and delete the account and information\nprovided from a potential contributor. The Association has a strict KYC/AML\npolicy complying with international standards. Any suspicious transaction and\nany suspicious facts related to members will be reported to the relevant\nauthorities without any further notice. \nA potential member not willing to participate in the KYC/AML process or a\npotential member not accepted in the KYC/AML process will not be accepted as a\nmember of the Association. \n\n8.1 The KYC process is set up as follows: \n- If the amount you send times the current multiplier is less than 5’000 CHF\nthen we need your name, Ethereum address and residency - If the amount you send\ntimes the current multiplier is between 5’000 and 15’000 CHF then you need\nto submit a photo of your passport - If the amount you send times the current\nmultiplier is between 15’000 and 50’000 CHF then you need to take a photo of\nyour passport and submit proof of residency - If the amount you send times the\ncurrent multiplier is between 50’000 and 100’000 CHF then you need to take a\nphoto of your passport, a selfie with your ID and submit proof of residency \n- If the amount you send times the current multiplier is above 100’000 CHF\nthen you need to take a photo of your passport, a selfie with your ID and submit\nproof of residency and have a video call with our team. \nWe expressly reserve the right to change the above mentioned requirements at any\ntime without any further notice. \nWe retain the right to reject membership applications for any reason, but if the\nmembership application is incomplete, or we believe the member has submitted\nmultiple applications, or the member is a resident of the USA, Iran, China\n(residents only), Afghanistan, Cuba, Democratic People's Republic of Korea,\nEthiopia, Guyana, Irak, Iran, Sri Lanka, Sudan, Syria, Trinidad and Tobago,\nVanuatu and Yemen, it is very likely that the membership will be denied. \n\n9. The membership fee is non-refundable Paying the membership fee is final and\nthe member has no right to ask for refund. \nThe member acknowledges that neither the Association nor any related party of\nthe Association is required to provide a refund for any reason and that the\nmember will not receive money or other compensation back. \n\n10. Risks \nBecoming a member of the Association may offer an opportunity for playing an\nactive role during the Build Phase in the development of a new ecosystem and for\nfuture capital gains in the Live Phase but also entail a high degree of business\nand financial risks, including the possibility of a complete loss of the paid\nfees. \n\n10.1 Financing \nThe Association requires sufficient capital to establish its Project. The\nAssociation intends to raise these funds through the membership fees. There are\nno plans to raise loan capital from third parties. The amount of funds actually\nraised through the membership fee is not known. Accordingly, there is the risk\nof a capital shortfall of the Association and we could not pursue our\nobjectives. If the Association is unable to obtain financing, the Association\nmay be required to significantly delay or discontinue the Project. \n\n10.2 Smart Contract Systems \nThe Association is, subject to general macro-economic developments such as\neconomic growth and inflation. Further, since the blockchain technology and the\nrelated industry are still relatively new and under development, the related\neconomic developments are relatively uncertain. There is no guarantee that the\nAssociation is able to build a fully functional iteration of the Smart Contract\nSystem and therefore the Live Phase may not happen for any iteration. It is not\nyet possible to predict the exact developments of the blockchain technology and\nto guarantee its functionalities and further evolutions. \n\n10.3 Cryptocurrencies \nThe value of cryptocurrencies is volatile and exposed to significant risks. The\nmembers are allowed to pay their membership fees in cryptocurrencies. The value\nof cryptocurrencies may change significantly (even on an intraday basis).\nAccordingly, the Association may incur exchange rate losses. \n\n10.4 Regulatory risks & changes in the supervisory practice \nBlockchain technology is in an early stage and might undergo significant changes\nand regulatory actions by the Swiss government or other authorities, which may\nresult in the illegality of certain transactions or the iteration of controls.\nTechnology relating to blockchain, including smart contracts and tokens, is\nstill at an early stage and best practices are still to be determined and\nimplemented. These technologies are likely to undergo significant changes in the\nfuture. Technological advances in smart contracts, cryptography, code breaking\nor quantum computing, etc. may pose a risk to its security. The functioning of a\nblockchain relies on open-source software. Developers of such open-source\nsoftware may introduce weaknesses and programming errors into the open-source\nsoftware or may stop developing the open-source software (potentially at a\ncritical stage where a security update is required), exposing smart contracts\nand tokens to weaknesses, programming errors and threats of fraud, theft, and\ncyber-attacks. There is no central body (e.g. a government agency) overseeing\nthe development of technology relating to the blockchain technology and its\nfunctioning, as well as further improvements of such functioning (e.g. ability\nto increase the number of transactions, reduce processing time, reduce\ntransaction fees, implement security updates), relies on the collaboration and\nconsensus of various stakeholders, among others, developers enhancing the\nopen-source software related to smart contracts and cryptocurrencies or\nso-called \"miners\" facilitating the processing of blockchain transactions. \nThere is a risk that the existing legal regulations may be amended and/or new\nlegal regulations could be introduced by the government. Any forthcoming\nregulatory actions may result in the illegality of certain blockchain\ntransactions or the iteration of controls relating to the trading (and therefore\nliquidity) of certain or even all tokens recorded and traded on a blockchain.\nOur intended Project may be restricted or could become impossible. \n\n11. Important Notice\nThe membership in the Association is not a security and gives no right to\ndividend payments, interest payments, or participation in the liquidation\nprocedure. The membership fee is non-refundable and all raised funds belong to\nthe Association and the Association is not obliged to pay anything back to the\nmembers. By becoming a member, you expressly acknowledge and represent that you\nhave carefully reviewed these Terms & Conditions and fully understand the risks,\ncosts, and benefits of the membership and agree to be bound by these Terms. \nYou further represent and warrant that, to the extent permitted by law, you are\nauthorized to become a member of the Association in your relevant jurisdiction,\nare of a legal age to be bound \nby these Terms & Conditions, and will not hold the Association, and the board\nmembers, directors, agents, joint ventures, employees and suppliers of the\nAssociation, now or in the future liable for any losses or any special,\nincidental or consequential damages arising out of, or in any way connected to\nthe membership in the Association. \nBecoming a member carries with it a number of risks. Prior to becoming a member\nof the Association, you should carefully consider the risks listed here and, to\nthe extent necessary, consult an appropriate lawyer, accountant or tax\nprofessional. If any of the following risks are unacceptable to you, you should\nnot become a member of the Association. \nThis document is not a solicitation for investment and does not pertain in any\nway to an offering of securities in any jurisdiction. Individuals, businesses,\nand other organizations should carefully weigh the risks, costs, and benefits of\nbecoming a member of the Association. \n\n12. Miscellaneous \n\n12.1 Force Majeure \nNeither members nor the Association will be liable to the other for any failure\nto fulfill obligations caused by circumstances outside its reasonable control. \n\n12.2 Third-party claims \nThese terms will not create any right or cause of action for any third party,\nincluding your affiliates. The Association will not be liable for any third\nparty claims against you, or your affiliates. \n\n12.3. Complete Agreement \nThese Terms sets forth the entire understanding between each member and the\nAssociation with respect to become a member of the association. \n\n12.4 Severability \nYou and the Association agree that if any portion of these Terms & Conditions is\nfound illegal or unenforceable, in whole or in part, such provision shall, as to\nsuch jurisdiction, be ineffective solely to the extent of such determination of\ninvalidity or unenforceability without affecting the validity or enforceability\nthereof in any other manner or jurisdiction and without affecting the remaining\nprovisions of the Terms & Conditions, which shall continue to be in full force\nand effect. \n\n12.5 Applicable law & Dispute Resolution \nThe Association is organized under Swiss law. Swiss material law is applicable.\nAll disputes, controversies or claims arising out of, relating to, or in\nconnection with the Terms, or the breach thereof, shall be settled by the\ncompetent court of Zug. \n\nCommons Stack Association, Zug, Switzerland. © Copyright 2019 Commons Stack\nAssociation. All Rights Reserved. \n"}
